Revit 2027 API
AdvancedWood Properties
The AdvancedWood type exposes the following members.
Properties
Name | Description
WoodCurlyDistortionEnable |  The property labeled "Enable distortion for wood secondary curly highlight" from the "AdvancedWood" schema.
WoodCurlyDistortionMap |  The property labeled "The 2D fiber distortion map (NO degamma op)" from the "AdvancedWood" schema.
WoodCurlyDistortionScale |  The property labeled "The scale of distortion for secondary curly highlight" from the "AdvancedWood" schema.
WoodDiffuseLobeWeight |  The property labeled "Weight of diffuse lobe" from the "AdvancedWood" schema.
WoodDiffusePerlinEnable |  The property labeled "Use perlin function for diffuse albedo" from the "AdvancedWood" schema.
WoodDiffusePerlinProf |  The property labeled "Profile for diffuse albedo perlin noise" from the "AdvancedWood" schema.
WoodDiffusePerlinScaleZ |  The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "AdvancedWood" schema.
WoodEarlyColor |  The property labeled "Earlywood color" from the "AdvancedWood" schema.
WoodEarlycolorPerlinEnable |  The property labeled "Use perlin noise for earlywood color" from the "AdvancedWood" schema.
WoodEarlycolorPerlinProf |  The property labeled "Profile for earlywood color perlin noise" from the "AdvancedWood" schema.
WoodEarlywoodSharpness |  The property labeled "Percentage of pure earlywood" from the "AdvancedWood" schema.
WoodFiberCosineEnable |  The property labeled "Use cosine function for wood fiber" from the "AdvancedWood" schema.
WoodFiberCosineProf |  The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.
WoodFiberPerlinEnable |  The property labeled "Use perlin noise for wood fiber" from the "AdvancedWood" schema.
WoodFiberPerlinProf |  The property labeled "Profile for fiber perlin noise" from the "AdvancedWood" schema.
WoodFiberPerlinScaleZ |  The property labeled "Anisotropic pos-z scale for fiber perlin" from the "AdvancedWood" schema.
WoodFiberRoughness |  The property labeled "Roughness for secondary highlight" from the "AdvancedWood" schema.
WoodGrooveRoughness |  The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.
WoodGrowthPerlinEnable |  The property labeled "Use perlin noise for ring growth" from the "AdvancedWood" schema.
WoodGrowthPerlinProf |  The property labeled "Profile for growth perlin noise" from the "AdvancedWood" schema.
WoodLatecolorPerlinEnable |  The property labeled "Use perlin noise for latewood color" from the "AdvancedWood" schema.
WoodLatecolorPerlinProf |  The property labeled "Profile for latewood color perlin noise" from the "AdvancedWood" schema.
WoodLateColorPower |  The property labeled "Power to compute latewood color" from the "AdvancedWood" schema.
WoodLatewoodBumpDepth |  The property labeled "Depth (cm) of the latewood bump" from the "AdvancedWood" schema.
WoodLatewoodRatio |  The property labeled "Percentage of latewood in each ring" from the "AdvancedWood" schema.
WoodLatewoodSharpness |  The property labeled "Percentage of pure latewood" from the "AdvancedWood" schema.
WoodManualLateColor |  The property labeled "Manual latewood color" from the "AdvancedWood" schema.
WoodPoreCellDim |  The property labeled "Dim (cm) of cell containing one pore" from the "AdvancedWood" schema.
WoodPoreColorPower |  The property labeled "Power to compute pore color" from the "AdvancedWood" schema.
WoodPoreDepth |  The property labeled "Bump depth variation (cm) for pores" from the "AdvancedWood" schema.
WoodPoreRadius |  The property labeled "Radius (cm) of the impact circle of each pore" from the "AdvancedWood" schema.
WoodPoreType |  The property labeled "Pore type" from the "AdvancedWood" schema.
WoodRayColorPower |  The property labeled "Power to compute ray color" from the "AdvancedWood" schema.
WoodRayEllipseRadiusX |  The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "AdvancedWood" schema.
WoodRayEllipseZ2x |  The property labeled "Ratio between two radii of ray ellipse" from the "AdvancedWood" schema.
WoodRayNumSlices |  The property labeled "Number of slices in xy plane" from the "AdvancedWood" schema.
WoodRaySegLengthZ |  The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.
WoodRingThickness |  The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.
WoodSecondaryColorPower |  The property labeled "Power to compute secondary highlight color" from the "AdvancedWood" schema.
WoodSecondaryPerlinEnable |  The property labeled "Use perlin noise for secondary highlight" from the "AdvancedWood" schema.
WoodSecondaryPerlinProf |  The property labeled "Profile for secondary highlight perlin noise" from the "AdvancedWood" schema.
WoodSecondaryPerlinScaleZ |  The property labeled "Anisotropic pos-z scale for secondary highlight perlin" from the "AdvancedWood" schema.
WoodUseGrooveRoughness |  The property labeled "Use additional groove roughness" from the "AdvancedWood" schema.
WoodUseLatewoodBump |  The property labeled "Use latewood bump" from the "AdvancedWood" schema.
WoodUseManualLateColor |  The property labeled "Use manual latewood color" from the "AdvancedWood" schema.
WoodUsePores |  The property labeled "Use pores feature" from the "AdvancedWood" schema.
WoodUseRays |  The property labeled "Use rays feature" from the "AdvancedWood" schema.
Top
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace